TFM_capa_limite/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (0 0 0)        // Vértice 0
    (0.150 0 0)      // Vértice 1
    (0.150 0.003 0)     // Vértice 2
    (0 0.003 0)       // Vértice 3
    (0 0 0.001)        // Vértice 4
    (0.150 0 0.001)      // Vértice 5
    (0.150 0.003 0.001)     // Vértice 6
    (0 0.003 0.001)       // Vértice 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 80 1) simpleGrading (1 1 1)  // Bloque principal
);




edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    wall_membrane
    {
        type wall;
        faces
        (
            (0 1 5 4)		

        );
    }
	wall_up
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }
	sides
    {
        type empty;
        faces
        (
            (0 3 2 1)		
            (4 7 6 5)

        );
    }
);
// ************************************************************************* //
